### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
ser=[4,8,15,16,23,42]
pd.Series(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
var = [1,2,3,'a','b','c',4,5,6,'d']
pd.Series(var)

0    1
1    2
2    3
3    a
4    b
5    c
6    4
7    5
8    6
9    d
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data:

In [4]:
data = {"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame in pandas is a two-dimensional, size-mutable, tabular data structure with columns of potentially different data types. It is similar to a spreadsheet or SQL table, or a dict of Series objects. In a DataFrame, each column is represented by a Series.

The main difference between a DataFrame and a Series is that a Series represents a single column of data, while a DataFrame represents a table of data with rows and columns. A DataFrame allows for more complex data analysis and manipulation compared to a Series.

In [6]:
import pandas as pd

# Create a Pandas Series
my_series = pd.Series([1, 2, 3, 4, 5])
print(my_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
# Create a Pandas DataFrame
data1 = {"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In this example, we created a Series called my_series with 5 elements. We then created a DataFrame called df with 3 columns: name, age, and gender. Each column is a Series object, with the name column containing strings, the age column containing integers, and the gender column containing strings. We printed both the Series and the DataFrame to illustrate the difference between the two.

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

There are many common functions available in Pandas DataFrame that can be used to manipulate data. Some of these functions are:

1. head() and tail(): Used to display the top or bottom n rows of the DataFrame. For example, df.head() will display the first 5 rows of the DataFrame df.

2. describe(): Used to get the summary statistics of the DataFrame. For example, df.describe() will display the count, mean, standard deviation, minimum, maximum, and quartile values of the DataFrame df.

3. drop(): Used to remove specified rows or columns from the DataFrame. For example, df.drop([0, 1], axis=0) will remove the first and second rows from the DataFrame df.

4. groupby(): Used to group the data based on one or more columns and perform aggregation on the groups. For example, df.groupby(['column1']).sum() will group the DataFrame df based on the values in column1 and return the sum of the remaining columns for each group.

5. sort_values(): Used to sort the DataFrame based on one or more columns. For example, df.sort_values(['column1'], ascending=False) will sort the DataFrame df based on the values in column1 in descending order.

6. fillna(): Used to fill missing values in the DataFrame with a specified value or method. For example, df.fillna(0) will fill all the missing values in the DataFrame df with 0.

7. merge(): Used to merge two or more DataFrames based on one or more common columns. For example, pd.merge(df1, df2, on='column1') will merge the DataFrames df1 and df2 based on the common column1.

One example of using these functions is in data cleaning and preparation. For instance, you may want to remove rows or columns with missing values using drop() or fillna(), sort the DataFrame based on a certain column to better understand the data using sort_values(), group the data based on certain criteria to aggregate information using groupby(), and merge multiple DataFrames to create a comprehensive dataset using merge().

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and DataFrame are mutable in nature. Panel is deprecated in the latest version of Pandas and is not recommended for use.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 30, 35, 40])

data = {'Name': names, 'Age': ages}

pd.DataFrame(data)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40